# การใช้ and or not ในโครงสร้างการควบคุมแบบเลือก

# 15 - 20 => วัยรุ่น
# 21 - 29 => วัยหนุ่มสาว
# 30 - 39 => วันผู้ใหญ่
# ใช้ and or not ในการเช็ค boolean


# and ต้องเป็นจริงทั้งสองข้าง   จะเป็นจริง
age = int(input("ป้อนอายุของคุณ"))

if age >= 15 and age <= 20:
    print('วัยของคุณคือ : ', "วัยรุ่น")
elif age >= 21 and age <= 29:
    print('วัยของคุณคือ : ', "วัยหนุ่มสาว")
elif age >= 30 and age <= 39:
    print('วัยของคุณคือ : ', "วัยผู้ใหญ่")
elif age >= 40:
    print('วัยของคุณคือ : ', "วัยผู้ใหญ่ - วัยชรา")
else:
    print('วัยของคุณคือ : ', "วัยเด็ก")

print("จบโปรแกรม")


# or ต้องเป็นจริงข้างใดข้างหนึ่ง จะเป็นจริง
if age >= 15 or age <= 20:
    print('วัยของคุณคือ : ', "วัยรุ่น")
else:
    print('วัยของคุณคือ : ', "วัยเด็ก")


#not จะแสดงค่าจริงเท็จในทางตรงกันข้าม
if not age >= 15:
    print('วัยของคุณคือ : ', "วัยรุ่น")
else:
    print('วัยของคุณคือ : ', "วัยเด็ก")
