# function input

# รับค่าที่ผู้ใช้ป้อนเข้ามาแล้วเก็ยลงตัวแปร fname
fname = input("กรุณาป้อนชื่อของท่าน :")
# รับค่าที่ผู้ใช้ป้อนเข้ามาแล้วเก็ยลงตัวแปร lname
lname = input("กรุณาป้อนนามสกุลของท่าน : ")
print("ชื่อของคุณ = "+fname)
print("นามสกุลของคุณ = "+lname)

# ลองเป็นตัวเลข
x = input("ป้อนตัวเลขที่ 1 : ")  # รับค่าที่ผู้ใช้ป้อนเข้ามาแล้วเก็ยลงตัวแปร x
y = input("ป้อนตัวเลขที่ 2: ")  # รับค่าที่ผู้ใช้ป้อนเข้ามาแล้วเก็ยลงตัวแปร y

# process
x = int(x)
y = int(y)
z = x+y
# หรือจะใส่ int ตรง input เลยก็ได้

# output
print(z)
